---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FailuresAccessor
source: html/10faf952-802b-9fba-aedc-a2657490b4d8.htm
---
# FailuresAccessor Members

Checks if pending failure processing can be finished by committing a pending transaction.